Ran Plan for dir: `terragrunt/kubernetes/renovate` workspace: `terragrunt_kubernetes_renovate`

<details><summary>Show Output</summary>

```diff
Authenticated

10:29:05.819 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/ZdbT4E7XTiF16qRyqfuMSJ_ASpY/ReTUVIsfc_e0fQxylKZxKCZJne8
10:29:05.843 INFO   tofu: Initializing the backend...
10:29:06.113 INFO   tofu: Initializing provider plugins...
10:29:06.114 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
10:29:06.312 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
10:29:06.452 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
10:29:06.537 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
10:29:06.659 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
10:29:06.768 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
10:29:06.903 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
10:29:07.002 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
10:29:07.141 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
10:29:07.156 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
10:29:07.230 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
10:29:07.250 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
10:29:07.261 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
10:29:07.293 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
10:29:07.328 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
10:29:07.348 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
10:29:07.348 INFO   tofu: OpenTofu has been successfully initialized!
10:29:08.012 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
10:29:08.012 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
10:29:08.012 STDOUT tofu:   ~ update in-place
10:29:08.012 STDOUT tofu: OpenTofu will perform the following actions:
10:29:08.012 STDOUT tofu:   # helm_release.renovate will be updated in-place
10:29:08.013 STDOUT tofu:   ~ resource "helm_release" "renovate" {
10:29:08.013 STDOUT tofu:       ~ id                         = "renovate" -> (known after apply)
10:29:08.013 STDOUT tofu:       ~ metadata                   = {
10:29:08.013 STDOUT tofu:           ~ app_version    = "41.46.3" -> (known after apply)
10:29:08.013 STDOUT tofu:           ~ chart          = "renovate" -> (known after apply)
10:29:08.013 STDOUT tofu:           ~ first_deployed = 1746674676 -> (known after apply)
10:29:08.013 STDOUT tofu:           ~ last_deployed  = 1754130344 -> (known after apply)
10:29:08.013 STDOUT tofu:           ~ name           = "renovate" -> (known after apply)
10:29:08.013 STDOUT tofu:           ~ namespace      = "renovate" -> (known after apply)
10:29:08.013 STDOUT tofu:           ~ revision       = 33 -> (known after apply)
10:29:08.013 STDOUT tofu:           ~ values         = jsonencode(
10:29:08.013 STDOUT tofu:                 {
10:29:08.013 STDOUT tofu:                   - envFrom  = [
10:29:08.013 STDOUT tofu:                       - {
10:29:08.013 STDOUT tofu:                           - secretRef = {
10:29:08.013 STDOUT tofu:                               - name = "renovate-env"
10:29:08.013 STDOUT tofu:                             }
10:29:08.013 STDOUT tofu:                         },
10:29:08.013 STDOUT tofu:                     ]
10:29:08.013 STDOUT tofu:                   - renovate = {
10:29:08.013 STDOUT tofu:                       - config = jsonencode(
10:29:08.013 STDOUT tofu:                             {
10:29:08.013 STDOUT tofu:                               - gitAuthor    = "YouHide Renovate Bot <youhide_renovate@none.com>"
10:29:08.013 STDOUT tofu:                               - platform     = "github"
10:29:08.013 STDOUT tofu:                               - repositories = [
10:29:08.013 STDOUT tofu:                                   - "youhide/hideForming",
10:29:08.013 STDOUT tofu:                                 ]
10:29:08.013 STDOUT tofu:                             }
10:29:08.013 STDOUT tofu:                         )
10:29:08.013 STDOUT tofu:                     }
10:29:08.013 STDOUT tofu:                 }
10:29:08.013 STDOUT tofu:             ) -> (known after apply)
10:29:08.013 STDOUT tofu:           ~ version        = "41.46.3" -> (known after apply)
10:29:08.013 STDOUT tofu:         } -> (known after apply)
10:29:08.013 STDOUT tofu:         name                       = "renovate"
10:29:08.013 STDOUT tofu:       ~ version                    = "41.46.3" -> "42.4.0"
10:29:08.013 STDOUT tofu:         # (26 unchanged attributes hidden)
10:29:08.013 STDOUT tofu:     }
10:29:08.013 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
10:29:08.013 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Frenovate%252Fterragrunt_kubernetes_renovate)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```